// Написать программу вычисления значения 
// функции y = sin(a). (Класс Math).

double a=3.14;
double y=Math.Sin(a);
Console.WriteLine(y);



